[
{
    "model": "kbItems.kbitem",
    "pk": 1,
    "fields": {
        "URI": "https://thestayathomechef.com/how-to-cook-steak/",
        "userTags": "",
        "itemContent": "Join My Meal Plan Today! →\nHome › Video › How to Cook Steak Perfectly Every Time\nLearn how to cook steak perfectly every single time with this easy to follow recipe! Sear your beef in a skillet and finish it in the oven for delicious, steakhouse results. \nLearn how to cook steak perfectly every single time with this easy to follow recipe where steak is seared in a skillet on the stove and finished in the oven. \nThere are three grades of beef steak that you will find in a US supermarket: Select, Choice, and Prime. Select is generally the grade of sale-priced, or advertised meat. Select grade is just above what the USDA deems edible. So if you buy Select grade meat, don’t be surprised when it isn’t that great. It will always be worth it to pay the extra money per pound for the Choice grade. If it is choice grade, it will be advertised as such and marked somewhere on the label or packaging. If your supermarket carries Prime grade, lucky you!\nBuy Choice or Prime Grade steaks for best results.\nWhether you like your steak practically raw on the plate, or dry as a bone, this steak doneness chart should help you out. The chef’s standard level of doneness is medium-rare. At this point it  will be tender, juicy, and if you do it just right the steak will melt in your mouth. With practice you can tell how cooked a steak is just by feel alone. Every steak has a different cooking time due to varying thicknesses of the cuts. Be wary following anything that tells you a cooking time rather than a temperature. Use an instant read meat thermometer for the most accurate results.\nWhat cut of steak you make depends on what you like in a steak. There are 5 main steak options, each a little bit different in their texture and tenderness.\nWhat is it? Porterhouse and T-Bone steaks are similar cuts of beef that come from the short loin. These cuts both have a T-shaped bone in the middle and contain two different pieces of meat: tenderloin and strip steak. Porterhouse steaks are cut from the rear end of the short loin and contain a larger portion of the tenderloin, while T-Bone steaks are cut from the front end and contain a smaller portion of the tenderloin.\nWhy use it? This steak gives you two different steaks in one! One side is super meaty, the other tender. The bone in the middle keeps things cooking evenly.\nWhat is it? Ribeye is a beef steak that is cut from the rib area, between ribs six through twelve. It is a flavorful, marbled piece of beef that yields a very tender result when cooked hot and fast. You can buy both bone-in and boneless ribeye steak.\nWhy use it? The marbling of fat in this steak yields a melt-in-your-mouth steak when cooked correctly. The bone-in variety will help the steak cook more evenly. This is a fattier cut of steak that pickier eaters might not appreciate.\nWhat is it? New York Strip steak is a lean cut of beef from the short loin area. It is one side of the porterhouse or T-bone steak and is always served boneless.\nWhy use it? This is a lean cut of beef steak with little fat. It is an excellent choice for mass appeal.\nWhat is it? Top Sirloin comes from the back area continuing off the short loin area. Top sirloin has bones and the bottom round muscles removed.\nWhy use it? This is a less expensive cut of steak that can still yield a tender and flavorful result. This cut of steak is best suited for marinating and is a more budget conscious steak option.\nWhat is it? Filet mignon comes from the small tip portion of the tenderloin.\nWhy use it? This is the most tender piece of beef steak and is still quite lean. It is a pricey option, but the resulting melt-in-your-mouth tenderness is unparalleled.\nThere is an endless debate amongst foodies about whether steaks are better bone-in or boneless, or whether or not it matters at all. Those who advocate for bone-in say that the flavorful marrow from the bone will seep into your meat while cooking, giving you a more flavorful result.\nBone-in DOES impact the cooking time of your steak. The bone changes the way the heat is distributed while cooking. It actually helps your steak cook more evenly and gives you a little more leeway with overcooking. Bone-in steaks will require a longer cooking time because the bone insulates the meat surrounding it. It takes a little more time for the heat to penetrate the interior, but once it does it spreads out evenly.\nIf you liked this recipe you may be interested in these other steak options, from beef to pork to seafood:\n\n\n\n\n\nAbout The Stay At Home Chef\nWe share restaurant-quality recipes you can easily make at home. Our team of chefs and creatives is bringing back the family dinner in a really delicious way!\nYour email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\n\n\n\nI’ve used this method many times.\nBut, have you tried the COLD PAN METHOD? Awesome!\nI truly appreciate this recipe and video for cooking the perfect steak! I just made our Anniversary dinner and always come right back here to refresh my memory on how to cook it perfectly! Steak is SO expensive these days and you can’t risk not having it done to perfection! Thank you again!\nWe absolutely love this recipe! I knew for Valentine’s Day I would be making a steak dinner and this is the only way I cook our steaks! Thank you!\nYummy! Like this alternate method of oven cooking.\n©2023 The Stay At Home Chef. All rights reserved. Privacy Policy • Cookie Policy • Ad Choices\nHow to Cook Steak Perfectly Every Time\nWhat are the different grades of beef?\nWhat temperature should steak be cooked to?\nWhat cut of steak should I use?\n\nHow to Cook Steak Perfectly Every Time\nLeave a comment\n58 Comments\nPorterhouse and T-Bone Steaks\nRibeye Steak\nNew York Strip Steak\nTop Sirloin Steak\nFilet Mignon\nBone-in vs Boneless Steaks\n\n\n\n\nIngredients \n1X\n2X\n3X\nInstructions \nNotes\nRestaurant Basting Method:\nReverse Sear:\nGrilling Instructions:\nNutrition\nComment navigation\n",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 25,
    "fields": {
        "URI": "https://twitter.com/MarioNawfal/status/1679878494963023876?s=20",
        "userTags": "",
        "itemContent": " X\n\nQ_ Explore\n\n{> Settings\n\n<€ Tweet , Mario Nawfal @ @MarioNawfal ES BREAKING: META'S TWITTER CLONE DEAD?\n\nIgnore the barrage of biased legacy media headlines on how many Instagram users are downloading Meta’s Twitter Copycat.\n\nOn Tuesday and Wednesday, the app's daily active users (the metric that matters) were down about 20% from Saturday, and the time spent per user was down 50%, from 20 minutes to 10 minutes.\n\nGoogle Search results, a great early indicator of a trend, shows a 75% drop in searches, an astonishing and rapid drop.\n\nDavid Webb from Similarweb said “while there was intense interest in checking out the app initially, not every user has made a habit of visiting the app as often as they might other social apps.”\n\nZuckerberg may as well drop the clone as he did with all his other clones over the years.\n\nNo one knows for sure why the engagement is dropping so catastrophically, but I’m not surprised.\n\nHere’s an exert from my previous tweet, and the prediction seems to be materializing: \"Zuckerberg's Twitter clone is riding on Instagram to attract new downloads, but there are major issues with this new app\" that could lead to high churn:\n\n1) CENSORSHIP: Meta’s experience is fundamentally different to @elonmusk's vision for Twitter due to their excessive and biased censorship, impeding one’s right to Free Speech.\n\n2) PREMATURE APP LAUNCH: The app’s experience is a VERY bare- bones version of Twitter with limited functionality, limited features and, in my opinion, a very ‘meh’ experience.\n\n3) BRIDGE FOR INSTAGRAM USERS TO JOIN TWITTER: | predicted that Instagram users who download and use the app, and actually enjoy it,\n\nDon’t miss what’s happening\n\nPeople on Twitter are the first to know.\n\nNew to Twitter?\n\nSign up now to get your own personalized timeline!\n\nG Sign up with Google @ Sign up with Apple\n\nCreate account\n\nBy signing up, you agree to the Terms of Service and Privacy Policy, including Cookie Use.\n\nRelevant people\n\n, Mario Nawfal @ r Follow ) @MarioNawfal NO BIAS, NO ECHO CHAMBERS: Host\n\nof Twitter’s Largest Spaces\n\n\n\nCEO @\n\n|BCgroup.io\n\n\n\nFounder @ Froothie\n\nTrends are unavailable.\n\nTerms of Service Privacy Policy Cookie Policy Accessibility Adsinfo More--- ©2023 X Corp.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 26,
    "fields": {
        "URI": "https://twitter.com/GuyDealership/status/1678533370958032896?s=20",
        "userTags": "",
        "itemContent": " xX € Tweet New to Twitter?\n\n® CarDealershipGuy @ cee Sign up now to get your own personalized timeline! Q Explore & @GuyDealership G Sign up with Google . Something very strange is happening. {} Settings Bvery strang ppening\n\n@ Sign up with Apple Used car supply is at historic lows, yet we *just* experienced the largest monthly decline in used car prices on record.\n\nCreate account But that doesn’t make sense — If supply is so low, prices should stay By signing up, you agree to the Terms of Service and high... right? Privacy Policy, including Cookie Use.\n\nWrong.\n\nRelevant people\n\nIt seems like between the Credit Crunch (aka lack of financing\n\navailability for consumers) and rapidly increasing new car incentives, used car prices are beginning to experience accelerated deflation.\n\n& CarDealershipGuy @ @GuyDealership Unbiased & transparent insights into the car market. Anonymous car Weird times my friends. dealer. Featured in Apple News and\n\nNY Post. Host @CDG_ Podcast 10:35 PM - Jul 10, 2023 - 3.9M Views\n\n906 Retweets 133 Quotes 8,119Likes 687 Bookmarks Trends are unavailable.\n\nb\n\n@) an iv) A\n\nTerms of Service Privacy Policy Cookie Policy Accessibility Adsinfo More--- ©2023 X Corp.\n\nDon’t miss what’s happening\n\nPeople on Twitter are the first to know.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 27,
    "fields": {
        "URI": "https://twitter.com/WallStreetSilv/status/1679588837301923841?s=20",
        "userTags": "",
        "itemContent": " xX € Tweet New to Twitter?\n\nWall Street Silver @ cee Sign up now to get your own personalized timeline!\n\nQ_ Explore @WallStreetSilv G Sign up with Google 3} Settings Blockchain developer Pedro Magalhdes claims that he has successfully reverse-engineered the source code of Brazil’s pilot central bank digital @ Sign up with Apple currency (CBDC). Create account\n\nHe revealed the existence of functions that empower a central authority to freeze funds or reduce balances. By signing up, you agree to the Terms of Service and\n\nBrazil's CBDC pilot nelevant people code reveals ability WalsweetSiver® qm\n\n@WallStreetSilv\n\nto freeze and fatleSher Pete reduce funds\n\nTrends are unavailable.\n\n® ByRonyRoy = July 11, 2023 at 11:55 am\n\nTerms of Service Privacy Policy Cookie Policy Accessibility Adsinfo More--- ©2023 X Corp.\n\n8:29 PM\n\n\n\nJul 13, 2023\n\n\n\n1.9M Views\n\n8,170 Retweets 619 Quotes 16.7K Likes 854 Bookmarks\n\nb\n\noO ty iv) W\n\nDon’t miss what’s happening\n\nPeople on Twitter are the first to know.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 31,
    "fields": {
        "URI": "https://www.instagram.com/reel/CsPAreZuh4T/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\ngolfstronghitbombs\n\n\n\nFollow\n\nOriginal audio\n\nTrain Your Hips To Move Powerfully @\n\ngolfstronghitbombs This is such a great drill for teaching powerful lower body movement!\n\nJust beware it is not easy!\n\n| would recommend teeing the ball up when practicing so you don't get frustrated and quit ©\n\nBut it really will teach the proper sequencing of lower body movement and how to use the ground to transmit speed to the club.\n\nFor more tips:\n\n@FOLLOW @golfstronghitbombs & There is also a drill we Used toymake Follow @golfstronghitbombs\n\n9 AV W\n\n3,372 likes\n\nMAY 14\n\nLog in to like or comment.\n\nMore posts from golfstronghitbombs\n\n93¥Y yds Pard 7 . . re a\n\nPlay Torrey With Me\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 32,
    "fields": {
        "URI": "https://www.instagram.com/reel/CszDLDdsa_u/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\ngolfstronghitbombs\n\n\n\nFollow\n\nKerala Dust » Nevada\n\ngolfstronghitbombs This is the most actionable drill | know for fixing a slice.\n\nThe two keys are: swing in to out, and allow the club to release and pass your hands and body as you swing through.\n\nStart with 25\n\n\n\n50% swings and build\n\nup to full speed.\n\nMy Favorite | ~\n\nAnti-Slice Drill @ ii For more tips FIX YOUR ; @FOLLOW @golfstronghitbombs ¢\n\nV9 AV W\n\n6,811 likes\n\nMAY 28\n\nLog in to like or comment.\n\nMore posts from golfstronghitbombs\n\n93¥Y yds Pard . . . . a\n\nPlay Torrey With Me\n\n=~\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 35,
    "fields": {
        "URI": "https://www.healthline.com/health/fitness-exercise/best-chest-exercises",
        "userTags": "",
        "itemContent": " Health Conditions v Discover v Plan v Connect v\n\nhealthline\n\nTrying to eat healthy?\n\nSign up for our nutrition newsletter\n\nhealthline\n\n7 Top Chest Exercises for a Strong and Functional Upper Body\n\nMuscles targeted | Tips for hypertrophy | Diet | 8 best exercises\n\nBottom line\n\nPerforming chest exercises, such as push-ups and bench presses, can help increase the strength and definition of your chest muscles.\n\nThe chest muscles could be considered a defining part of strength anatomy. They are involved in actions such as squeezing a set of loppers to cut a tree branch and pushing a door open. They are also the primary muscles referenced when debating upper body strength (“How much can you bench, bro?”).\n\nFor body builders and those interested in general muscular aesthetics, the chest muscles are the defining part of muscle mass. Powerlifters rely on them for the bench press to score the greatest lift.\n\nBut these muscles are also incredibly important from a functional standpoint because they support the movement of the arms.\n\nA number of studies examining perceived attractiveness found that a low waist-to-chest ratio was rated as the most attractive physical feature on males (1%). This is when a person has a narrower waist and broader chest.\n\nBut gender-specific beauty standards aside, everyone can benefit from strengthening the chest muscles — whether vour adoal is to have sculpted pecs or simply to be able to play Twister with\n\nSUBSCRIBE Q\n\nMedically reviewed by ad Daniel Bubnis, M.S., NASM- ee, CPT, NASE Level II-CSS, . Fitness — By Travis\n\n<= edwards, PT, MPT —\n\nUpdated on March 29, 2023\n\nTrying to\n\neat healthy?\n\nSign up to our\n\nnutrition newsletter eG\n\nYe\n\nhealthline\n\no",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 60,
    "fields": {
        "URI": "https://www.verywellfit.com/20-great-exercises-to-work-your-shoulders-1231032",
        "userTags": "",
        "itemContent": "These exercises target the shoulders—the front, middle, and rear deltoids as well as the rotator cuff muscles. Choose a variety of exercises to target each part of the shoulders for a well-rounded workout routine.\nUse enough weight that you can only complete the desired number of reps.\nAn overhead press, also called a military press, with a barbell is probably one of the hardest shoulder exercises you can do.1 When you lift anything overhead, it's tough, but using a barbell, you can really lift heavy. Keep your back straight. If you have to arch your back to get the weight up, it's too heavy.\nVerywell / Ben Goldstein\nThe overhead dumbbell press allows you to work each arm individually. When you use a barbell, as in the previous exercise, your stronger arm may do more of the work. Having a weight in each hand forces each shoulder to work on its own.\nThe Arnold press doesn't look like a big deal, but adding rotation involves the front deltoid a bit more than a regular overhead press. You start with the palms facing in and then, as you press the arms up, your rotate the hands so that they're facing out. It's tougher than it looks.\nWhen you do one arm at a time, you not only challenge your shoulder, you challenge your core.2 Sit on an exercise ball and you add even more instability, which helps you work on balance, stability, core, and shoulder strength all at the same time.\nAnother variation on the overhead press is to alternate arms. This adds some variety and you focus on keeping the core strong as you slowly alternate sides. This can really change how the exercise feels.\nUsing the band for an overhead press means you get more time under tension. The band makes your muscles work on the way up and on the way down, unlike dumbbells. You'll want a light band for this, or just do one arm at a time.\nVerywell / Ben Goldstein\nThe front raise works the front of the deltoids.3 Because the arms are straight and coming up to the front of the body, you need to be sure you have the right size weights. You'll also feel your core work as you lift the weights up.\nTake the front raise up a notch in intensity by getting into an incline position on the ball. You'll really feel gravity working against you here, and you'll feel your lower body kick into gear. Be sure to lift only to shoulder level and don't swing the weights, but lift them slowly.\nVerywell / Ben Goldstein\nLateral raises are a classic shoulder exercise, targeting the front and mid deltoids. This long lever move has your arms almost straight (your elbows should be slightly bent) which means you typically stick with a lighter weight for this exercise.\nThis takes the typical lateral raise and shortens the lever with arms bent at 90 degrees. This allows you to lift a little heavier weight than you probably would with lateral raises. It's a variation that fires your muscle fibers in a different way.\nIf you want to add intensity and a balance challenge, prop one side of the body on the ball at an angle and lift a lighter weight just to shoulder level. With gravity working against you, you'll really work your deltoids.4\nNow we move to the back of the shoulders—the rear delts as well as the upper back. For the reverse fly move, you want a slight bend in the elbows. Make sure you lead with the elbows. You want a lighter weight here so you don't have to heave to lift the weights up. They should only go to shoulder level.\nThis move targets the rear deltoid as well as the upper back. Because you're on your hands and knees, you can really focus on the working arm. The idea is to keep your elbow slightly bend and to lead with that elbow when lifting the arm up.\nIn this move, you're standing, which means you're involving the entire body. You're also using a band, which adds intensity.5 Stand on the band and bring the opposite arm across the body, focusing on the rear delt and the upper back.\nIn this version of the rear fly, the ball gives you support while also adding a little instability. You're at the perfect angle to lift the weights up to torso level. The elbows are bent here, so you're squeezing the shoulder blades and working the shoulders as well as the upper back.\nThis exercise is a great warm-up for the arms and the upper back. You need to keep your hands the right distance apart to keep tension on the band when your arms come together and with you squeeze them apart. This, again, works the shoulders and the upper back.\nYour rotators are the smallest muscles of the shoulder, but the most prone to injury.6 For this move, you want to keep the elbow next to the body as you open the arm up, taking it as far back as your flexibility allows.\nThis move is the opposite move from the external rotation above. Now you're rotating the arm and shoulder inward, working the rotators in a different way. You'll probably need more tension on the band for this exercise.\nVerywell / Ben Goldstein\nUpright rows are another great move for the shoulders, but you want to make sure you do them right. Slowly pull the weights up, keeping them very close to your body, and take the elbows just a bit higher than the shoulders.\nIf you really want a tough exercise, this is it. Also called a pike push-up or down-dog push-up, this move is like a push-up for your shoulders; you're in a pike position doing push-ups. Balancing on an exercise ball makes this move even harder.\n\n\n\n\n\n\nBy Paige Waehner, CPT\nPaige Waehner is a certified personal trainer, author of the \"Guide to Become a Personal Trainer,\" and co-author of \"The Buzz on Exercise & Fitness.\"\n\n\n\n\n\n\n20 Great Exercises to Work Your Shoulders\nHow to Set Up a Shoulder Routine\nOverhead Press With a Barbell\nOverhead Dumbbell Press\nArnold Press\nOne-Arm Press\nAlternating Overhead Press\nBand Overhead Press\nFront Raise\nIncline Front Raise\nLateral Raise\nBent Arm Lateral Raise\nOne Arm Lateral Raise on the Ball\nReverse Fly\nOne Arm Band Rear Fly\nCrossover Rear Delt Fly With Band\nIncline Rear Fly on the Ball\nBand Rear Delt Squeeze\nExternal Shoulder Rotation With Band\nInternal Shoulder Rotation With Bands\nUpright Rows\nShoulder Push-Up\n",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 61,
    "fields": {
        "URI": "https://www.healthline.com/health/fitness/leg-workout",
        "userTags": "",
        "itemContent": "Certain exercises, including squats and deadlifts, may help strengthen and tone your legs. Increasing sets and reps may help.\nStrong legs do more than look good. Even the simplest daily movements like walking require leg strength. This means that incorporating leg workouts into your routine is integral to your health.\nBut you may wonder where to begin.\nWhether you’re working out at home pandemic-style or back at the gym sweating it out, creating an effective leg workout doesn’t have to be complicated. Let’s dive in.\nWhen it comes to designing an effective leg workout, simpler is better. The basic lower body movements — squats, hip hinges (deadlifts), and lunges — should comprise the majority of your programming.\nThese movements inherently focus on the major muscle groups of the legs: the glutes, quads, hamstrings, and calves.\nOnce you master these movements, there are plenty of variations and ways to progress that will keep you challenged.\nWhen designing your leg workout, here’s an easy way to break it down: Start with a squat movement, then move to a hip-hinge movement, then add in your single-leg movements.\nAs a beginner looking to increase general fitness — and following the theme of keeping things simple — choose 3–5 exercises per leg workout. Then complete 3 sets of 8–12 reps of each exercise, ensuring that you’re working your muscles to fatigue but not failure (1).\nWhy no more than 5 exercises? You’ll be able to focus on those integral movements, performing at your peak. If your workouts get too long, they can be unproductive.\nRecent research suggests that when trying to maximize muscle growth, there’s not much difference between training the major muscle groups one time per week versus three times per week (3).\nWhat makes the most difference in muscle growth is resistance training volume, meaning how many sets and reps you’re completing. Higher volume sessions (say, 3 sets of 12 reps, or even 4 sets of 8 reps) tend to produce better results than working the same muscle group multiple times in a week (4).\nSimpler is better for leg workouts. Stick with the basic movements — squats, hip hinges, and lunges — and stick with 3 sets of 12 reps for each exercise.\nAn effective workout isn’t complete without a proper warmup and cooldown.\nFor your warmup, aim to start with 5 minutes of light cardio to get your heart rate up and blood flowing. If you have time, hop on the foam roller for 5 minutes of soft-tissue release.\nThen, dive into a dynamic stretching routine, with movements like leg swings, hip openers, bodyweight squats, and lunges.\nAfter your workout is a good time to complete a more in-depth stretching routine.\nWarm up with some light cardio, foam rolling, and a quick dynamic stretching routine. Cool down with a nice stretch.\nWhen crafting your next leg workout, choose from this list of 15 of the best leg exercises.\nTarget your posterior chain — or the back of your body, including the glutes and hamstrings — with a back squat.\nHow to perform:\nTarget the front of your body — especially your quads — with a front squat.\nHow to perform:\nBuild your glutes, hamstrings, and calves, as well as mobility in your hips, with a Romanian deadlift.\nHow to perform:\nWake up your hamstrings with the good morning, a hip-hinge movement.\nHow to perform:\nChallenge your balance, as well as your quads, hamstrings, and glutes, with walking lunges.\nHow to perform:\nA friendlier version of the forward lunge, the reverse lunge is a great exercise to execute ideal lunge positioning.\nHow to perform:\nAs humans, we move mostly in the front-to-back planes of movement. Doing side-to-side movements like lateral lunges helps increase stability and strength.\nHow to perform:\nIncrease strength, balance, and power with a stepup.\nHow to perform:\nThis exercise requires only your body weight.\nHow to perform:\nBuild strength and size in your glutes with the hip thrust.\nHow to perform:\nThe goblet squat is easier on your back than a back squat, but it still works your quads and glutes.\nHow to perform:\nWhile machines lack some of the benefits of free-weight exercises, machines like the leg press allow you to isolate specific muscles easily — in this case, the quads, hamstrings, and glutes.\nHow to perform:\nIsolate your hamstrings and calves with the leg curl machine.\nHow to perform:\nWork your legs and core with the Bulgarian split squat.\nHow to perform:\nWhip your hamstrings into shape and work on your balance with the single-leg deadlift.\nHow to perform:\nKeeping things simple when designing a leg workout is the most effective approach, especially for beginners. Choose 3–5 exercises, do them well, and watch your leg strength increase.\nLast medically reviewed on May 12, 2021\nOur experts continually monitor the health and wellness space, and we update our articles when new information becomes available.\nCurrent Version\nFeb 9, 2023\nWritten By\nNicole Davis, CPT\nEdited By\nSaralyn Ward\nMay 12, 2021\nWritten By\nNicole Davis, CPT\nEdited By\nSaralyn Ward\nMedically Reviewed By\nJake Tipane, CPT\nCopy Edited By\nChristina Guzik, BA, MBA\nShare this article\nA lat raise, or lateral raise, is a type of strength training exercise that builds muscle in the shoulders.\nTight glutes can be uncomfortable and make you more prone to certain injuries. Learn how to stretch your glute muscles safely and effectively, even if…\nOverstretching can result in an injury, such as a strain or a sprain. Learn how to avoid pushing your range of motion beyond your capability for…\nLooking to increase shoulder and upper back strength? Look no further than the upright row. This exercise targets the traps, which span the upper to…\nFitness trackers can be a great tool to upgrade your workout and enhance your health. Here are 8 of the best fitness trackers for women.\nDietary fat has a bad reputation, but fat isn’t necessarily a bad thing. Your body actually needs fat for energy and to process certain vitamins and…\nCreatine supplements are often used to enhance athletic performance and reduce muscle damage. Here are the 10 best creatine supplements for 2023.\nWhen designing a workout, it's important to move in all of the body's planes. What are they? Here's an anatomy primer to help.\nSee which massage guns our team picked to help you recover well after your next workout.\nFilter out the noise and nurture your inbox with health and wellness advice that’s inclusive and rooted in medical expertise.\nYour privacy is important to us\nOUR BRANDS\nHow to Design a Leg Workout Using the 15 Best Exercises\nMovement patterns in a good leg workout \nHow many sets and reps should you do in your leg workout?\nHow many times per week should you work legs?\nHow to warm up and cool down properly\nExercises for your leg workout \nThe bottom line\nGet our wellness newsletter\n1. Back squat\n2. Front squat\n3. Romanian deadlift\n4. Good mornings\n5. Walking lunges\n6. Reverse lunge\n7. Lateral lunge\n8. Stepup\n9. Glute bridge\n10. Hip thrust\n11. Goblet squat\n12. Leg press\n13. Leg curl\n14. Bulgarian split squat\n15. Single-leg deadlift\nHow we reviewed this article:\nREAD THIS NEXT\n\n",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 65,
    "fields": {
        "URI": "https://www.instagram.com/reel/CsYXeFGrYV6/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\n=) efficient.golf\n\n\n\nFollow\n\nSam Evian\n\n\n\nRight Down the Line\n\nefficient.golf Some of my shallowing the club thoughts “\n\n‘Feeling’ the hands working deeper behind you, not thrown out in-front will help with that over the top sensation\n\nFeel vs real — not many players actually get the club falling behind them in transition, but it can be a good thought to have to help put the club in the slot..\n\n~‘ #golf #golfswing #golfer #pga #tips \\ 10w\n\nbe 9 AV W\n\n171 likes\n\nMAY 18\n\nLog in to like or comment.\n\nMore posts from efficient.golf\n\nWarm up thoughts\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 66,
    "fields": {
        "URI": "https://www.instagram.com/reel/CrHGvy4uPHM/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\n=} timeonthelake\n\n\n\nFollow wee\n\nOriginal audio\n\ntimeonthelake How you can catch one of the MOST HATED fish in North America...\n\nThe common carp is native to Asia but was brought to North America by Europeans in the 1800s...\n\nThey are spread out throughout Eastern United States and Canada. They are abundant in the Great Lakes and many other bodies of water.\n\nThis was one of my first time targeting them in my home body of water...\n\nAlthough there's some controversy\n\naround these fish fight hard and are super fun. Not to mention easily\n\n9 AV W\n\n11,057 likes\n\nAPRIL 16\n\nLog in to like or comment.\n\nMore posts from timeonthelake\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 67,
    "fields": {
        "URI": "https://twitter.com/edkrassen/status/1679971231280365568?s=12&t=luE0t2rXCmHkF-x3pwIZ9g",
        "userTags": "",
        "itemContent": " X\n\nQ_ Explore\n\n{> Settings\n\n<€ Tweet Ed Krassenstein @ @EdKrassen Today Elon Musk held a Twitter Space to discuss xAl. Here is a recap of what was discussed for those who missed it:\n\nThe founding team was on hand to introduce themselves, and | must\n\nsay it is an impressive team with an impressive background. They had\n\nvery strong backgrounds with Deep Mind, OpenAl, Google, Tesla, etc.\n\nElon Musk said the goal with xAl is to build a good AGI (artificial general\n\nintelligence) with the purpose of understanding the universe.\n\nMusk said that the safest way is to build an AGI that is ‘maximum\n\ncurious’ and ‘truth curious, and to try and minimize the error between\n\nwhat you think is true and what is actually true.\n\nFor truth-seeking super intelligence humanity is much more interesting\n\nthan not humanity, so that’s the safest way to create one. Musk gave the\n\nexample of how space and Mars is super interesting but it pales in\n\ncomparison to how interesting humanity is.\n\nMusk said there is so much that we think we understand but we don’t\n\nin reality. There are a lot of unresolved questions. For example, there are\n\nmany questions that remain about the nature of gravity, and why there is\n\nnot massive evidence of aliens. He said he has seen no evidence of\n\naliens whatsoever so far. He went further into the Fermi Paradox and\n\nhow it's possible that other consciousness may not exist in our galaxy.\n\nIf you ask today’s advanced Als technical questions, you just get\n\nnonsense, so Musk believes we are really missing the mark by many\n\norders of magnitude and that needs to get better.\n\nxAl will use heavy computing, but the amount of ‘brute force’ will\n\nbecome less as they become to understand the problem better.\n\nCo-Founder Greg Yang said that the mathematics they find at xAi could\n\nopen up new perspectives to existing questions like the 'Theory of\n\nEverything:\n\nElon stated that you can't call anything AGI until the computer solves at\n\nleast one fundamental question.\n\nHe said that from his experience at Tesla, they have over complicated\n\nproblems. “We are too dumb to realize how simple the answers really\n\nare,' he said. \"We will probably find this out with AGI as well. Once AGI is\n\nsolved, we will look back and think, why did we think it would be so\n\nhard.”\n\nDon’t miss what’s happening\n\nPeople on Twitter are the first to know.\n\nNew to Twitter?\n\nSign up now to get your own personalized timeline!\n\nG Sign up with Google @ Sign up with Apple\n\nCreate account\n\nBy signing up, you agree to the Terms of Service and Privacy Policy, including Cookie Use.\n\nRelevant people\n\nCy Ed Krassenstein @\n\n@EdKrassen P Fotiow Living in reality. Independent journalist. Web3 & Al futurist. Subscribe for additional content.\n\nFollow my twin: @Krassenstein.\n\nSubscribe at: krassenstein.news\n\nTrends are unavailable.\n\nTerms of Service Privacy Policy Cookie Policy Accessibility Adsinfo More--- ©2023 X Corp.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 68,
    "fields": {
        "URI": "https://www.instagram.com/reel/Curj4UXgKQr/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\n© meandmygolf &@ + Follow GETTING THE CLUB FACE CLOSED & meandmygolf & What happens AFTER you've hit the ball is crucial!!\n\nAnd it all comes back to rotation.\n\nWe know by now that a slicer will suffer from having the club face open at impact. So, obviously the fix is we want to try and get it more closed.\n\nBy having a real focus on where the hands are AFTER impact, aiming to get the glove hand underneath the right hand (for the right handed golfer), will help aid that rotation of the club face.\n\nLike we always say though,\n\nrecording yourself from front on AND down the line is key, as often\n\n9 AV W\n\n1,467 likes\n\nJULY 14\n\nLog in to like or comment.\n\nMore posts from meandmygolf\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 69,
    "fields": {
        "URI": "https://www.instagram.com/reel/CujAuYyAZ20/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\nviktoria.semaan & @ ChatGPT rolled a new feature Code Interpreter. Here is my test of it for ML stock prediction. Follow for more @viktoria.semaan\n\n(a) viktoria.semaan & + Follow Maroon 5 » Cold (feat. Future)\n\nThis video is not about accuracy of stock prediction as it requires a lot more data to generate something meaningful. It’s about showcasing plug-in capabilities.\n\nNy\n\n=\n\nI'll answer your questions in the comments!\n\n{\n\n\\\n\na\n\nLet's ask ChatGPT tlenntocode #coding #technology to predict stock prices #ai #ml #chatgpt\n\n#artificialintelligence #developers\n\n#tech #aitools #artificialintelliaence\n\n9 AV W\n\n23,441 likes\n\nJULY 11\n\nLog in to like or comment.\n\nMore posts from viktoria.semaan\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 70,
    "fields": {
        "URI": "https://www.instagram.com/reel/CubW3EQg3y6/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\nviktoria.semaan & + Follow\n\nPitbull\n\n\n\note\n\n@ Back in Time (featured in \"Men In Blacl\n\nviktoria.semaan & . ) Goodbye outdated information from ChatGPT\n\nInstall free chrome extension WebChatGPT. It allows ChatGPT to get data online to provide up-to- date information.\n\nFollow @viktoria.semaan so you don’t miss new tech content!\n\nf Tags © Still using #learntocode #coding #technology\n\nF F #ai #ml #chatgpt\n\nlike this? ®\n\n; #artificialintelligence #developers\n\n#tech #aitools #artificialintelligence\n\n#gpt #generativeai #gpt4 #aichatbot\n\n#openai #genai #research #cloud\n\nEditad . Mw\n\nVGAaAV W\n\n3,387 likes\n\nJULY 8\n\nLog in to like or comment.\n\nMore posts from viktoria.semaan\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 71,
    "fields": {
        "URI": "https://www.instagram.com/reel/CurVzXtgMfD/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram Q Search Sign Up\n\n(G) larryrinkergolf @ + Follow = Original audio\n\nlarryrinkergolf @ If ur body turns early@from the top, you can never catch up. Here's a way to get rid of ur slice. #rinkersgolftips #golfswing #golftips #pgatour #golfswingtips #golfslice @ritzcarltonorlando\n\n2w\n\nS)\n\n9 kevandlaney What am i doing if i If, YOu bod y turns always hit left with my drivers and\n\nEarly\n\n\n\nfromthe top ne\n\nAndigets ahead of\n\nThe club;head\n\n\n\nyou\n\n— View replies (1)\n\nNie podmané @brandonpimentel\n\n9 AV W\n\n1,534 likes\n\nJULY 14\n\nLog in to like or comment.\n\nMore posts from larryrinkergolf\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 72,
    "fields": {
        "URI": "https://www.instagram.com/reel/CuuH982gUeM/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\n) terryderon\n\n\n\nFollow\n\nOriginal audio\n\ng terryderon This is the biggest issue _/ men have with women. It's almost impossible for men to resolve issues and have meaningful conversations because it's very difficult for men to express what they're thinking and feeling without a woman interrupting him, trying to put words in his mouth “so basically you're saying \"or trying to shame or humiliate him for how he feels. | mean just look at how women on social media respond to my page. I’ve been breaking down things from a male pov for years and | make sure | thoroughly articulate\n\nje | the male pov. And there are lots of Sis, Is he really a poor women that will dismiss my content, communicator orare you a try to flip the script on men, or find\n\nsome exception to the rule to\n\n9 AV W\n\n2,346 likes\n\nJULY 15\n\nconversation bully?...\n\nMore posts from terryderon\n\nQuestion: Does wanting to\n\ngo thru a man's phone Things women do that push a . automatically mean that a man away in a relationship. candidly about women!\n\nwoman is insecure?\n\n; :\n\nmen to finally speak\n\n1. Try to mother/coach him.\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 73,
    "fields": {
        "URI": "https://www.instagram.com/reel/CuUlf0TO_wJ/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\ndecoding_couples &@ - Follow Macklemore & Ryan Lewis, Macklemor White Walls (feat. ScHoolboy Q & Holli @ decoding_couples &@ Want better conversation which leads to better emotional intimacy? Try switching up\n\nthe “how was your day” question!\n\nWhich question will you try with your partner today??\n\nLet us know how it goes!!\n\n3w\n\nS)\n\nQO frannola He doesn't answer the same. | am desperate\n\niw Reply\n\nMD nun midline @\n\n9 AV W\n\n4,300 likes\n\nJULY 5\n\nLog in to like or comment.\n\nMore posts from decoding_couples\n\nthe same fight over\n\nand over again...\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 74,
    "fields": {
        "URI": "https://www.instagram.com/reel/CsRmI9QtN-z/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\nfairfiteats @\n\n\n\nFollow\n\nOriginal audio\n\n& fairfiteats @ Chipotle Chicken Burritos & (Makes 4 Burritos)\n\nMacros:\n\n380 Calories\n\n60g Protein\n\n7g Fat\n\n11g Carbs\n\nIngredients:\n\n1Cup Cottage Cheese (0% Fat)\n\n1/4 Enchilada Sauce\n\n1 Canned Chipotle Pepper\n\n240z Chicken Breast\n\nGarlic Salt\n\nSmoked Paprika\n\nOnion Powder\n\n1Can Chipotle Peppers\n\n1 Cup Fat Free Mozzarella\n\nFresh Chives\n\n380 Calories OAV W\n\n60g Protein 73,381 likes\n\nMAY 15\n\nLog in to like or comment.\n\nMore posts from fairfiteats\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 75,
    "fields": {
        "URI": "https://www.instagram.com/reel/Cu2XZsvrw4r/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\nprosperitynuggets\n\n\n\nFollow\n\nOriginal audio\n\ni]\n\nprosperitynuggets \"The kids who receive rewards for their effort and consistently choose more\n\nchallenging problems significantly\n\n— outperform the kids who are simply\n\n. U sal “ ww aS praised and given feedback on their ; x j intelligence.\" ee\n\ni]\n\n@hubermanlab\n\n#science #learning #growthmindset\n\n#health #parenting #teacher\n\nEdited\n\n\n\n1w\n\nPraise for\n\n\n\nintelligence\n\nS)\n\ndaneloevering Intrinsic motivation last\n\n8 longer\n\n1d Reply\n\n9 AV W\n\nLiked by aranzalewski and others JULY 18\n\nLog in to like or comment.\n\nMore posts from prosperitynuggets\n\nTHE COCA COLA\n\nCONSPIRACY\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 76,
    "fields": {
        "URI": "https://www.instagram.com/reel/CupiyZBMgOK/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\ncookingwithcarrrl » Follow\n\nOzzy Osbourne + see\n\n@ Crazy Train (2002 Version)\n\ncookingwithcarrrl Subway's been real quiet since | dropped this upgraded Chicken Bacon Ranch! #SubWaySandwich #ChickenBaconRanch v#/\n\nChicken Bacon Branch Sandwich - this will be your new go to griddle sammy this summer! Chicken & veggies in a simple ranch marinade, griddled, and topped with @branchsauce_co Branch sauce for that BBQ Ranch flavor explosion! Really enjoying this @webergrills griddle and all the fun accessories! #FriendsOfWeber #ChickenBacon #ChickenSub #GriddleCooking #ChickenSandwich #OhioFood\n\n9 AV W\n\n14,978 likes\n\nJULY 13\n\nLog in to like or comment.\n\nMore posts from cookingwithcarrrl\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 77,
    "fields": {
        "URI": "https://www.instagram.com/reel/Cu2D3CyrGHl/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\nraziyyz + Follow 7 Original audio Fasy, Healthi asy, Cd ler raziyyz Chili Lime Chicken Burritos. Chicken Burrito Pack wa prten ae aur Done in 20 minutes! ©\n\nChicken:\n\n+ 2 chicken breast (approx. 300g total)\n\n+ 1tsp olive oil\n\n+ 1/2 tsp salt, pepper, chili powder, cumin\n\n+ 1tsp paprika and garlic powder\n\n+ Squeeze of half a lime\n\nChili Lime Sauce:\n\n+ 3 tbsp light mayo (or 1/4 cup greek yogurt and 1/4 tsp salt)\n\n+ 1tbsp hot sauce\n\n+ 1/4 tsp chili powder and garlic powder\n\n+ Squeeze of half a lime\n\n9 AV W\n\n102,405 likes\n\nJULY 18\n\nLog in to like or comment.\n\nMore posts from raziyyz\n\nOVErYMt Uals\n\nchocolate strawberry, high protein, low cal\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 78,
    "fields": {
        "URI": "https://www.instagram.com/reel/CvAtU0HRrpk/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " qnstagram. Q Search Sign Up\n\n3 : © thatgolfgrind - Follow . MF DOOM - ? (Instrumental) ; (s) thatgolfgrind Stop Rolling The Club Club\n\nRolling the club like this can cause major inconsistencies in your swing. To fix this, feel like you're back palm is pointed down towards the ground as you take it away. This will keep that club face more on plane.\n\nFollow to lower your score! DM me for online lesson info\n\n#golf #golftips #golfswing #golfdrills\n\n#golfcoach #golflesson #reels\n\n5d\n\n)\n\n9 AV W\n\n1,594 likes\n\n5 DAYS AGO\n\nLog in to like or comment.\n\nMore posts from thatgolfgrind\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 79,
    "fields": {
        "URI": "https://www.instagram.com/reel/Cthyx1cuRAc/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram, Q Search Sign Up\n\na) brycecopegolf @ - Follow Foster The People « Helena Beat\n\nbrycecopegolf & This feel is one that hips home. As a player that has a horrible habit of getting stuck underneath and hitting blocks/hooks when I'm off this is one of my go to feels to get the hips out of the way. Working on a version of this feel at the moment and ball striking has been money. Give it a try if you feel like you're getting stuck at impact.\n\nSTOP, GETTING STUCK;\n\nCode “BRYCECOPE20\" for 20% off (ON}THE/DOWN{S WING) @stitchgolt\n\n#golf #golfswing #golfer #golfing\n\n#golflife\n\n6w\n\n)\n\n9 AV W\n\n1,545 likes\n\nJUNE 15\n\nLog in to like or comment.\n\nMore posts from brycecopegolf\n\nYee\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 80,
    "fields": {
        "URI": "https://www.instagram.com/reel/CrrdZjrNc-_/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram Q Search Sign Up\n\nbrycecopegolf & This set up change has been a game changer for a lot of players I've worked with. Keeping the trail elbow locked in place too long into the backswing cause the elbow to pull around the body which gets the club into a less than ideal position. Try these set up adjustments to get the backswing into a better place.\n\nbrycecopegolf &\n\n\n\nFollow\n\n——\n\nSSS\n\nGETTING\n\nCode “BRYCECOPE20\" for 20% off @stitchgolf\n\n#golf #golflife #golfswing #golftips\n\n12w\n\nS)\n\nVAY W\n\n2,263 likes\n\nAPRIL 30\n\nLog in to like or comment.\n\nMore posts from brycecopegolf\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.kbitem",
    "pk": 81,
    "fields": {
        "URI": "https://www.instagram.com/reel/CvFl3vyR-JO/?igshid=MTc4MmM1YmI2Ng%3D%3D",
        "userTags": "",
        "itemContent": " Instagram Q Search Sign Up\n\nalexelliottgolf @\n\n\n\nFollow\n\nOriginal audio\n\nCs) alexelliottgolf @ 1 MINUTE SLICE FIX! -& - follow this step by step guide and eradicate that SLICE FOR GOOD! #golf #golfswing #golflife #theopen\n\n4d\n\nS)\n\nberyl_ducks brilliant drill &\n\n3d Reply\n\n@ jasongibbons89 @alexwesley89 @conwez this guy does the best drills and has the best tips Ive found.\n\n3d 3likes Reply\n\n— View replies (1)\n\n9 AV W\n\n2,357 likes\n\n4 DAYS AGO\n\nLog in to like or comment.\n\nMore posts from alexelliottgolf\n\nSCOTTIE'SCHEFFLER\n\nBACKSWING DRILL,\n\nLog into Instagram\n\nLog in to see photos and videos from friends and discover other accounts you'll love.",
        "userID": 1
    }
},
{
    "model": "kbItems.imagekbitem",
    "pk": 25,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 26,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 27,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 31,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 32,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 35,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 65,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 66,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 67,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 68,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 69,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 70,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 71,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 72,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 73,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 74,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 75,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 76,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 77,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 78,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 79,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 80,
    "fields": {}
},
{
    "model": "kbItems.imagekbitem",
    "pk": 81,
    "fields": {}
},
{
    "model": "kbItems.textkbitem",
    "pk": 1,
    "fields": {}
},
{
    "model": "kbItems.textkbitem",
    "pk": 60,
    "fields": {}
},
{
    "model": "kbItems.textkbitem",
    "pk": 61,
    "fields": {}
}
]
